<img height="200" width="1000" src="logotm.png" >


<center><h1><u>Welcome to the Python for data analyst course </u></h1></center><center><h2>Class 3</h2></center>

In [11]:
import pandas as pd

In [13]:
pd.read_csv('data/customers_info.csv')

           id  age          job   marital  education housing loan_alive
0      106787   26       admin.    single  secondary     yes         no
1      132205   72      retired   married  secondary      no         no
2      117181   42  blue-collar   married    primary     yes         no
3      130998   41   unemployed   married    primary      no         no
4      130997   41     services   married    unknown     yes         no
...       ...  ...          ...       ...        ...     ...        ...
45206  123950   32   management    single   tertiary     yes         no
45207  113174   59  blue-collar  divorced    primary      no        yes
45208  133773   32  blue-collar    single  secondary      no         no
45209  117992   35     services   married  secondary      no         no
45210  123030   31   technician    single  secondary      no         no

[45211 rows x 7 columns]

In [15]:
df = pd.read_csv('data/customers_info.csv', index_col='id')
df

        age          job   marital  education housing loan_alive
id
106787   26       admin.    single  secondary     yes         no
132205   72      retired   married  secondary      no         no
117181   42  blue-collar   married    primary     yes         no
130998   41   unemployed   married    primary      no         no
130997   41     services   married    unknown     yes         no
...     ...          ...       ...        ...     ...        ...
123950   32   management    single   tertiary     yes         no
113174   59  blue-collar  divorced    primary      no        yes
133773   32  blue-collar    single  secondary      no         no
117992   35     services   married  secondary      no         no
123030   31   technician    single  secondary      no         no

[45211 rows x 6 columns]

# Indexes

#### Get label index values using index attribute

In [19]:
df.index

Index([106787, 132205, 117181, 130998, 130997, 135560, 111058, 132247, 101522,
       131133,
       ...
       136666, 136665, 142609, 134923, 106781, 123950, 113174, 133773, 117992,
       123030],
      dtype='int64', name='id', length=45211)

#### Get column values using

In [22]:
df.values

array([[26, 'admin.', 'single', 'secondary', 'yes', 'no'],
       [72, 'retired', 'married', 'secondary', 'no', 'no'],
       [42, 'blue-collar', 'married', 'primary', 'yes', 'no'],
       ...,
       [32, 'blue-collar', 'single', 'secondary', 'no', 'no'],
       [35, 'services', 'married', 'secondary', 'no', 'no'],
       [31, 'technician', 'single', 'secondary', 'no', 'no']],
      dtype=object)

In [24]:
# Shows the values in marital series
df['marital'].values

array(['single', 'married', 'married', ..., 'single', 'married', 'single'],
      dtype=object)

#### in operator

In [27]:
# Check if value is in the label index
133773 in df.index

True

In [29]:
'single' in df['marital']

False

In [31]:
# Check if value is in the values of chosen series
'single' in df['marital'].values

True

In [75]:
    df['marital'].value_counts(ascending=False)

marital
married     27214
single      12790
divorced     5207
Name: count, dtype: int64

In [35]:
df['marital'].value_counts().tail(1)

marital
divorced    5207
Name: count, dtype: int64

#### Check if column has unique values

In [38]:
# Check if the index is unique
df.index.is_unique

True

In [40]:
# Check if values in series is unique
df['age'].is_unique

False

# Min / Max methods

#### Get max value index

In [44]:
df['age'].max()

95

#### Get the row number (integer index) if the highest value in column

In [47]:
df['age'].argmax()

37545

In [49]:
# check the value in that position
df.iloc[37545]

age                  95
job             retired
marital         married
education     secondary
housing              no
loan_alive           no
Name: 141664, dtype: object

In [51]:
# Get the whole row of the highest value in a column
df.iloc[ df['age'].argmax() ]

age                  95
job             retired
marital         married
education     secondary
housing              no
loan_alive           no
Name: 141664, dtype: object

#### Return index of first occurrence of maximum

In [54]:
df['age'].idxmax()

141664

In [56]:
df.loc[141664]

age                  95
job             retired
marital         married
education     secondary
housing              no
loan_alive           no
Name: 141664, dtype: object

#### Get the row number (integer index) if the lowest value in column

In [59]:
df['age'].argmin()

7768

#### Return index of first occurrence of miniimum

In [62]:
df['age'].idxmin()

140737

In [64]:
df.loc[140737]

age                18
job           student
marital        single
education     primary
housing            no
loan_alive         no
Name: 140737, dtype: object

# value_counts()

In [67]:
# Shows the distribution of values in chosen column
df['job'].value_counts()

job
blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: count, dtype: int64

In [69]:
df['job'].value_counts(ascending=True).head()

job
unknown          288
student          938
housemaid       1240
unemployed      1303
entrepreneur    1487
Name: count, dtype: int64

In [71]:
# How many times each row repeats
df.value_counts()

age  job          marital   education  housing  loan_alive
30   management   single    tertiary   no       no            144
36   blue-collar  married   secondary  yes      no            136
32   blue-collar  married   secondary  yes      no            124
     management   single    tertiary   no       no            123
35   blue-collar  married   secondary  yes      no            123
                                                             ...
33   technician   divorced  unknown    yes      no              1
                            primary    yes      no              1
49   blue-collar  married   tertiary   no       no              1
                                       yes      no              1
95   retired      married   secondary  no       no              1
Name: count, Length: 7634, dtype: int64

In [73]:
df.iloc[:,[0,1]].value_counts()

age  job
33   management       507
32   management       498
34   management       484
31   management       478
35   management       465
                     ...
71   self-employed      1
     management         1
     entrepreneur       1
70   unknown            1
64   self-employed      1
Name: count, Length: 596, dtype: int64

# nunique()

In [27]:
# Shows how many unique values are in each series
df.nunique()

age           77
job           12
marital        3
education      4
housing        2
loan_alive     2
dtype: int64

In [28]:
# Shows how many unique values are in chosen series
df['job'].nunique()

12

#### Get only the unique labels

In [29]:
df['job'].unique()

array(['admin.', 'retired', 'blue-collar', 'unemployed', 'services',
       'management', 'entrepreneur', 'technician', 'self-employed',
       'housemaid', 'student', 'unknown'], dtype=object)

# Sorting

#### sort_values ()

In [30]:
# Sort by the rows by the value in marital series
df.sort_values('marital', ascending=False)

        age            job   marital  education housing loan_alive
id
106787   26         admin.    single  secondary     yes         no
120740   32     management    single   tertiary      no         no
103429   41     management    single   tertiary     yes         no
134615   31       services    single  secondary     yes         no
141743   33     management    single   tertiary      no         no
...     ...            ...       ...        ...     ...        ...
101424   53    blue-collar  divorced    primary     yes         no
111777   40  self-employed  divorced  secondary      no        yes
101656   43    blue-collar  divorced    primary     yes         no
130749   27  self-employed  divorced  secondary     yes         no
122746   35     management  divorced   tertiary      no         no

[45211 rows x 6 columns]

In [31]:
# Sort by the rows by the value in marital series and then by age series
df.sort_values(['marital', 'age'], ascending=False, inplace=True)

In [32]:
df

        age          job   marital  education housing loan_alive
id
142461   86      retired    single  secondary      no         no
131052   83      retired    single    primary      no         no
141790   83      retired    single    primary      no         no
141523   77      retired    single    primary      no         no
141424   73      retired    single  secondary      no         no
...     ...          ...       ...        ...     ...        ...
106516   25   technician  divorced   tertiary      no        yes
106935   25  blue-collar  divorced  secondary     yes         no
135585   25   technician  divorced   tertiary     yes         no
113287   25   technician  divorced  secondary      no        yes
138567   24  blue-collar  divorced  secondary     yes         no

[45211 rows x 6 columns]

#### sort_index ()

In [33]:
# Sort the rows by the label index value
df.sort_index(ignore_index=True)

       age           job   marital  education housing loan_alive
0       58    management   married   tertiary     yes         no
1       44    technician    single  secondary     yes         no
2       33  entrepreneur   married  secondary     yes        yes
3       47   blue-collar   married    unknown     yes         no
4       33       unknown    single    unknown      no         no
...    ...           ...       ...        ...     ...        ...
45206   51    technician   married   tertiary      no         no
45207   71       retired  divorced    primary      no         no
45208   72       retired   married  secondary      no         no
45209   57   blue-collar   married  secondary      no         no
45210   37  entrepreneur   married  secondary      no         no

[45211 rows x 6 columns]

In [34]:
df

        age          job   marital  education housing loan_alive
id
142461   86      retired    single  secondary      no         no
131052   83      retired    single    primary      no         no
141790   83      retired    single    primary      no         no
141523   77      retired    single    primary      no         no
141424   73      retired    single  secondary      no         no
...     ...          ...       ...        ...     ...        ...
106516   25   technician  divorced   tertiary      no        yes
106935   25  blue-collar  divorced  secondary     yes         no
135585   25   technician  divorced   tertiary     yes         no
113287   25   technician  divorced  secondary      no        yes
138567   24  blue-collar  divorced  secondary     yes         no

[45211 rows x 6 columns]